hex_data = [
    "04000000", "04000000",
    "01020300", "04050600", "07080900", "0A0B0C00",
    "0D0E0F00", "10111200", "13141500", "16171800",
    "191A1B00", "1C1D1E00", "1F202100", "22232400",
    "25262700", "28292A00", "2B2C2D00", "2E2F3000"
]

# Открываем файл для записи в бинарном режиме
with open('binary_data.bin', 'wb') as file:
    for hex_str in hex_data:
        # Преобразуем шестнадцатеричное значение в байты
        binary_data = bytes.fromhex(hex_str)
        # Записываем байты в файл
        file.write(binary_data)